---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureVRepeat
source: html/c10e4858-85a8-4bd2-9089-26987114b097.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureVRepeat Property

The property labeled "V Repeat" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureVRepeat { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".